<a href="https://colab.research.google.com/github/Chebet-Mercy/Chebet-Mercy.github.io/blob/master/Mercy_Chebet_Week_1_Daily_Challenges_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Setting up SQL

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.8 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
%load_ext sql

In [3]:
%%sql

sqlite:///zindua_demo.db

Creating Customers Table

In [4]:
%%sql

 -- Create the Customers Table

CREATE TABLE Customers (
    customer_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(100)
);

 * sqlite:///zindua_demo.db
Done.

[]

Inserting data into Customers Table

In [5]:
%%sql

INSERT INTO customers (customer_id, first_name, last_name, email) VALUES
    (1, 'John', 'Doe', 'johndoe@email.com'),
    (2, 'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva', 'Fisher', 'evafisher@email.com'),
    (7, 'George', 'Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
    (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///zindua_demo.db
13 rows affected.

[]

Products Table

In [6]:
%%sql

-- Create the Products Table

CREATE TABLE products ( product_id INT AUTO_INCREMENT PRIMARY KEY, product_name VARCHAR(100), price DECIMAL(10, 2) );

-- Insert Example Data into the Products Table
INSERT INTO products (product_id, product_name, price) VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

 * sqlite:///zindua_demo.db
Done.
13 rows affected.

[]

Orders Table

In [7]:
%%sql

-- Create the Orders Table

CREATE TABLE orders ( order_id INT AUTO_INCREMENT PRIMARY KEY, customer_id INT, order_date DATE );

-- Insert Example Data into the Orders Table
INSERT INTO orders (order_id, customer_id, order_date) VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

 * sqlite:///zindua_demo.db
Done.
16 rows affected.

[]

Order_Items Table

In [8]:
%%sql

-- Create the Order_Items Table

CREATE TABLE order_items ( order_id INT, product_id INT, quantity INT );

-- Insert Example Data into the Order_Items Table
 INSERT INTO order_items (order_id, product_id, quantity) VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///zindua_demo.db
Done.
32 rows affected.

[]

In [9]:
%%sql

SELECT*FROM Customers
LIMIT 7

 * sqlite:///zindua_demo.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com')]

In [10]:
%%sql

SELECT*FROM products
LIMIT 7

 * sqlite:///zindua_demo.db
Done.

[(1, 'Product A', 10),
 (2, 'Product B', 15),
 (3, 'Product C', 20),
 (4, 'Product D', 25),
 (5, 'Product E', 30),
 (6, 'Product F', 35),
 (7, 'Product G', 40)]

In [11]:
%%sql

SELECT*FROM orders
LIMIT 7

 * sqlite:///zindua_demo.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07')]

In [12]:
%%sql

SELECT*FROM order_items
LIMIT 7

 * sqlite:///zindua_demo.db
Done.

[(1, 1, 2), (1, 2, 1), (2, 2, 1), (2, 3, 3), (3, 1, 1), (3, 3, 2), (4, 2, 4)]

## **DAY 3**

Which products has the highest price

In [13]:
%%sql

SELECT product_id,product_name,MAX (price) AS highest_price
FROM products

 * sqlite:///zindua_demo.db
Done.

[(13, 'Product M', 70)]

Which order_id had the highest number of items in terms of quantity

In [14]:
%%sql

SELECT order_id, MAX (quantity) AS max_quantity
FROM order_items

 * sqlite:///zindua_demo.db
Done.

[(4, 4)]

## **DAY 4**

Which customer has made the most orders?

In [19]:
%%sql

    SELECT c.customer_id as "customer_id",
     c.first_name AS "customer_name",
     COUNT(o.order_id) AS "total_orders"

    FROM customers c
    JOIN orders o
    ON c.customer_id = o.customer_id

    --Grouping
    GROUP BY c.customer_id
    ORDER BY total_orders DESC;

 * sqlite:///zindua_demo.db
Done.

[(3, 'Bob', 2),
 (2, 'Jane', 2),
 (1, 'John', 2),
 (13, 'Sophia', 1),
 (12, 'Quinn', 1),
 (11, 'Oliver', 1),
 (10, 'Lily', 1),
 (9, 'Kevin', 1),
 (8, 'Ivy', 1),
 (7, 'George', 1),
 (6, 'Eva', 1),
 (5, 'Charlie', 1),
 (4, 'Alice', 1)]

What’s the total revenue per product?

In [22]:
%%sql

SELECT p.product_name AS products,
  p.price * SUM(io.quantity) AS product_revenue

FROM products p
JOIN order_items io

ON io.product_id = p.product_id
GROUP BY p.product_name, p.price;

 * sqlite:///zindua_demo.db
Done.

[('Product A', 50),
 ('Product B', 135),
 ('Product C', 160),
 ('Product D', 75),
 ('Product E', 90),
 ('Product F', 210),
 ('Product G', 120),
 ('Product H', 135),
 ('Product I', 150),
 ('Product J', 330),
 ('Product K', 180),
 ('Product L', 195),
 ('Product M', 420)]

# **DAY 5**
1. Find the first order (by date) for each customer.

In [25]:
%%sql

SELECT o.customer_id,
   o.order_id,
   MIN(o.order_date) AS first_order,
   c.first_name,
   c.last_name

FROM orders o
JOIN customers c

ON o.customer_id = c.customer_id

GROUP BY 1

 * sqlite:///zindua_demo.db
Done.

[(1, 1, '2023-05-01', 'John', 'Doe'),
 (2, 2, '2023-05-02', 'Jane', 'Smith'),
 (3, 3, '2023-05-03', 'Bob', 'Johnson'),
 (4, 7, '2023-05-07', 'Alice', 'Brown'),
 (5, 8, '2023-05-08', 'Charlie', 'Davis'),
 (6, 9, '2023-05-09', 'Eva', 'Fisher'),
 (7, 10, '2023-05-10', 'George', 'Harris'),
 (8, 11, '2023-05-11', 'Ivy', 'Jones'),
 (9, 12, '2023-05-12', 'Kevin', 'Miller'),
 (10, 13, '2023-05-13', 'Lily', 'Nelson'),
 (11, 14, '2023-05-14', 'Oliver', 'Patterson'),
 (12, 15, '2023-05-15', 'Quinn', 'Roberts'),
 (13, 16, '2023-05-16', 'Sophia', 'Thomas')]

2. Find the day with the highest revenue.

In [28]:
%%sql

SELECT o.order_date,
   SUM(p.price * oi.quantity) AS Revenue

FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN products p ON p.product_id = oi.product_id

GROUP BY o.order_date
ORDER BY Revenue DESC
LIMIT 1;

 * sqlite:///zindua_demo.db
Done.

[('2023-05-16', 340)]